/* 
docker attach เพื่อเชื่อมต่อ Shell ของคุณเข้ากับกระบวนการนั้น ในกรณีนี้เป็นการเชื่อมต่อกับกระบวนการ Bash Shell ภายใน Container ชื่อ "test" ที่เราสร้างไว้ก่อนหน้านี้

docker attach test
คำสั่งนี้ใช้สำหรับเชื่อมต่อ Shell ของคุณเข้ากับกระบวนการหลักภายใน Container ที่มีชื่อว่า "test"
หลังจากรัน docker attach เสร็จ Prompt ของ Shell จะเปลี่ยนไป แสดงว่าคุณได้เชื่อมต่อกับ Container สำเร็จแล้ว

Ctrl-PQ
กดปุ่ม Ctrl-PQ เพื่อตัดการเชื่อมต่อกับ Container

คำสั่ง docker attach จะช่วยให้คุณสามารถเชื่อมต่อกับกระบวนการหลักที่กำลังรันอยู่ภายใน Container ได้ ซึ่งในกรณีนี้คือกระบวนการ Bash Shell ที่เราสั่งให้ Container รันเมื่อสร้างขึ้นมา หลังจากเชื่อมต่อแล้ว คุณจะสามารถรันคำสั่งต่างๆ ภายใน Container ได้เช่นเดียวกับการรันผ่าน docker run และเมื่อต้องการตัดการเชื่อมต่อ ให้กดปุ่ม Ctrl-PQ
*/